In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/conda/lib/python3.10/site-packages (2.9.5)
Note: you may need to restart the kernel to use updated packages.

In [4]:
engine = create_engine('postgresql://root:root@pgdatabase:5432/ny_taxi')

In [6]:
query = """
select count(*) from green_taxi_data
"""

pd.read_sql(query, con=engine)

    count
0  630918

TASK 3

In [7]:
query = """
select count(1) num from green_taxi_data
where cast(lpep_dropoff_datetime as date) = '2019-01-15' and cast(lpep_pickup_datetime as date) = '2019-01-15'
"""
pd.read_sql(query, con=engine)

     num
0  20530

TASK 4

In [27]:
query = """
select cast(lpep_pickup_datetime as date), max(trip_distance) from green_taxi_data
group by 1
order by 2 desc
limit 1
"""
pd.read_sql(query, con=engine)

  lpep_pickup_datetime    max
0           2019-01-01  59.13

TASK 5

In [10]:
query = """
select count(1) num from green_taxi_data
where cast(lpep_pickup_datetime as date) = '2019-01-01' and
passenger_count = 2;
"""
pd.read_sql(query, con=engine)

    num
0  1282

In [11]:
query = """
select count(1) num from green_taxi_data
where cast(lpep_pickup_datetime as date) = '2019-01-01' and
passenger_count = 3
"""
pd.read_sql(query, con=engine)

   num
0  254

TASK 6

In [31]:
query = """
select dz.zone, t.tip_amount from green_taxi_data t
left join zones pz on (pz.locationid = t."PULocationID")
left join zones dz on (dz.locationid = t."DOLocationID")
where pz.zone = 'Astoria'
group by 1,2
order by 2 desc
limit 1
"""
pd.read_sql(query, con=engine)

                            zone  tip_amount
0  Long Island City/Queens Plaza        88.0